def F(n):
    return a*b
def G(n):
    return c*d
def H(n):
    return v*n
print("Введите первую сторону первого прямоугольника:")
a=int(input())
print("Введите вторую сторону первого прямоугольника:")
b=int(input())
print("Введите первую сторону второго прямоугольника:")
c=int(input())
print("Введите вторую сторону второго прямоугольника:")
d=int(input())
print("Введите первую сторону третьего прямоугольника:")
v=int(input())
print("Введите вторую сторону третьего прямоугольника:")
n=int(input())
print("Площадь первого прямоугольника:")
print(F(n))
print("Площадь второго прямоугольника:")
print(G(n))
print("Площадь третьего прямоугольника:")
print(H(n))